In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('5. London Housing Data.csv')
df.head(3)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN

In [3]:
df.tail(3)

            date     area  average_price       code  houses_sold  no_of_crimes
13546  11/1/2019  england         248515  E92000001      67814.0           NaN
13547  12/1/2019  england         250410  E92000001          NaN           NaN
13548   1/1/2020  england         247355  E92000001          NaN           NaN

In [4]:
df.shape

(13549, 6)

In [5]:
df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [6]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

Q. 1) Convert the Datatype of 'Date' column to Date-Time format.

In [7]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN

In [8]:
df['Year'] = df['date'].apply(lambda x: x.split('/')[2])
df['Month'] = df['date'].apply(lambda x: x.split('/')[0])
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,Year,Month
0,1/1/1995,city of london,91449,E09000001,17.0,NaN,1995,1
1,2/1/1995,city of london,82203,E09000001,7.0,NaN,1995,2

Q. 4) Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

In [9]:
data = df.copy()
data.dropna(axis=0, inplace=True)

In [10]:
data.isnull().sum()

date             0
area             0
average_price    0
code             0
houses_sold      0
no_of_crimes     0
Year             0
Month            0
dtype: int64

In [11]:
data.shape

(7375, 8)

In [13]:
zero_crime = data[data['no_of_crimes'] == 0]
zero_crime

,date,area,average_price,code,houses_sold,no_of_crimes,Year,Month
72,1/1/2001,city of london,284262,E09000001,24.0,0.0,2001,1
73,2/1/2001,city of london,198137,E09000001,37.0,0.0,2001,2
74,3/1/2001,city of london,189033,E09000001,44.0,0.0,2001,3
75,4/1/2001,city of london,205494,E09000001,38.0,0.0,2001,4
76,5/1/2001,city of london,223459,E09000001,30.0,0.0,2001,5
...,...,...,...,...,...,...,...,...
178,11/1/2009,city of london,397909,E09000001,11.0,0.0,2009,11
179,12/1/2009,city of london,411955,E09000001,16.0,0.0,2009,12
180,1/1/2010,city of london,464436,E09000001,20.0,0.0,2010,1
181,2/1/2010,city of london,490525,E09000001,9.0,0.0,2010,2
182,3/1/2010,city of london,498241,E09000001,15.0,0.0,2010,3

In [14]:
len(zero_crime)

104

Q. 5) What is the maximum & minimum 'average_price' per year in england ?

In [15]:
data.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,Year,Month
72,1/1/2001,city of london,284262,E09000001,24.0,0.0,2001,1
73,2/1/2001,city of london,198137,E09000001,37.0,0.0,2001,2

In [29]:
groupbyyear = data.groupby('Year')['average_price'].sum().reset_index()
groupbyyear.nlargest(1,'average_price')[['Year', 'average_price']]

    Year  average_price
16  2017      203052918

In [30]:
groupbyyear.nsmallest(1,'average_price')[['Year', 'average_price']]

   Year  average_price
0  2001       70030391

Q. 6) What is the Maximum & Minimum No. of Crimes recorded per area ?

In [34]:
group_by_area = data.groupby('area')['no_of_crimes'].sum().reset_index()
group_by_area.head(2)

                   area  no_of_crimes
0  barking and dagenham      362895.0
1                barnet      516539.0

In [36]:
group_by_area.nlargest(1, 'no_of_crimes')[['area', 'no_of_crimes']]

           area  no_of_crimes
32  westminster     1197877.0

In [37]:
group_by_area.nsmallest(1, 'no_of_crimes')[['area', 'no_of_crimes']]

             area  no_of_crimes
6  city of london          47.0

Q. 7) Show the total count of records of each area, where average price is less than 100000.

In [39]:
group_area_price = data.groupby('area')['average_price'].sum().reset_index()

In [40]:
group_area_price.head(5)

                   area  average_price
0  barking and dagenham       43160860
1                barnet       82135740
2                bexley       50738124
3                 brent       73451969
4               bromley       67981477

In [42]:
len(group_area_price[group_area_price['average_price'] < 100000])

0